tap "azure/kubelogin"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
brew "azure-cli"
brew "bat"
brew "binutils"
brew "chezmoi"
brew "pinentry"
brew "gnupg"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "tmux"
brew "gitmux"
brew "go"
brew "httpie"
brew "hugo"
brew "ispell"
brew "kubernetes-cli"
brew "markdown"
brew "mas"
brew "neovim"
brew "pinentry-mac"
brew "postgresql@18"
brew "ripgrep"
brew "wakatime-cli"
brew "wakeonlan"
brew "zsh"
brew "azure/kubelogin/kubelogin"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-dbus", "with-imagemagick", "with-mailutils"]
brew "hashicorp/tap/terraform"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "discord"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "maccy"
cask "numi"
cask "spotify"
cask "syncthing-app"
cask "thunderbird"
cask "wakatime"
cask "whatsapp"
mas "Amphetamine", id: 937984704
