benmezger/slimfish
smh/base16-shell-fish
edc/bass
barnybug/docker-fish-completion
jethrokuan/z
brigand/fast-nvm-fish
fishpkg/fish-humanize-duration
matchai/anybar-fish
