slack-desktop
solaar
ttf-font-awesome
i3blocks
ttf-inconsolata-dz
xss-lock
xfce4-pulseaudio-plugin
stremio-bin
fasd
numix-icon-theme-git
sift-bin
git-crypt
fasd
fpp-git
urxvt-fullscreen
dropbox
slack-desktop
keybase-bin
cryptomator
thunar-dropbox
