# Taps
tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "git-chglog/git-chglog"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "discoteq/discoteq"
tap "koekeishiya/formulae"

# brew install
brew "ack"
brew "libyaml"
brew "openssl@1.1"
brew "readline", link: true
brew "ansible"
brew "antibody"
brew "asciinema"
brew "aspell"
brew "astyle"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bash"
brew "bfg"
brew "binutils"
brew "libffi"
brew "capstone"
brew "ccache"
brew "cmake"
brew "gcc"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cookiecutter"
brew "coreutils", link: true
brew "llvm"
brew "cquery"
brew "gawk"
brew "gnu-sed"
brew "libtool"
brew "make", link: false
brew "ncurses"
brew "crosstool-ng"
brew "csvkit"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "dtc"
brew "editorconfig"
brew "exa"
brew "expat"
brew "z.lua"
brew "fd"
brew "pkg-config"
brew "fish"
brew "fzf"
brew "nss"
brew "git"
brew "libusb"
brew "gnupg"
brew "gnuplot"
brew "go", link: true, force: true
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "ispell"
brew "isync"
brew "javacc"
brew "jq"
brew "libftdi"
brew "loc"
brew "lsusb"
brew "mas"
brew "md5sha1sum", link: false
brew "minicom"
brew "mkcert"
brew "mosh"
brew "multimarkdown"
brew "nasm"
brew "neovim"
brew "zlib"
brew "pandoc"
brew "pgcli"
brew "pidof"
brew "pinentry-mac"
brew "pre-commit"
brew "pypy3"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tor", restart_service: true
brew "tree"
brew "vim", args: ["HEAD"]
brew "wakatime-cli"
brew "watch"
brew "wget"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-mailutils", "with-no-frame-refocus", "with-native-comp", "with-xwidgets"], link: true
brew "git-chglog/git-chglog/git-chglog"
brew "heroku/brew/heroku"
brew "podman"
brew "git-lfs"
brew "msmtp"
brew "neomutt"
brew "isync"
brew "mu"
brew "weechat"
brew "htop"
brew "xclip"
brew "terminal-notifier"
brew "1password-cli"
brew "gstreamer"
brew "koekeishiya/formulae/skhd", restart_service: true
brew "rclone"
brew "flock"
brew "neofetch"
brew "tmuxinator"
brew "plantuml"
brew "shfmt"
brew "shellcheck"
brew "git-delta"
brew "libmagic"
brew "fortune"
brew "poetry"
brew "w3m"
brew "gist"
brew "wordnet"
brew "notmuch"
brew "libgccjit"

cask "1password"
cask "alacritty"
cask "basictex"
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-powerline-symbols"
cask "insomnia"
cask "maccy"
cask "ngrok"
cask "postgres-unofficial"
cask "sloth"
cask "spotify"
cask "telegram"
cask "transmission"
cask "firefox"
cask "numi"
cask "brave-browser"
cask "whatsapp"
cask "slack"
cask "discord"
cask "skim"
cask "clocker"
cask "bettertouchtool"
cask "trailer"
