tap "d12frosted/emacs-plus"
tap "hashicorp/tap/terraform"

brew "python@3.13"
brew "chezmoi"
brew "fzf"
brew "gnupg"
brew "httpie"
brew "ledger"
brew "lua"
brew "pinentry-mac"
brew "tmux"
brew "wakatime-cli"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-mailutils", "with-native-comp"]
brew "ripgrep"
brew "coreutils", link: true
brew "binutils"
brew "sqlite"
brew "direnv"
brew "eza"
brew "fd"
brew "gh"
brew "mas"
brew "neovim"
brew "terraform"
brew "ispell"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "chatgpt"
cask "claude"
cask "font-hack-nerd-font"
cask "maccy"
cask "spotify"
cask "whatsapp"
cask "numi"
cask "backblaze"
cask "wakatime"

mas "Amphetamine", id:937984704
