tap "d12frosted/emacs-plus"
tap "homebrew/bundle"

brew "antidote"
brew "python@3.13"
brew "chezmoi"
brew "fzf"
brew "gnupg"
brew "httpie"
brew "ledger"
brew "lua"
brew "pinentry-mac"
brew "poetry"
brew "tmux"
brew "wakatime-cli"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-mailutils", "with-native-comp"]
brew "ripgrep"
brew "ripgrep"
brew "coreutils", link: true
brew "binutils"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "chatgpt"
cask "discord"
cask "docker"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "maccy"
cask "spotify"
cask "whatsapp"
cask "numi"
