;; -*- no-byte-compile: t; -*-

(package! pyenv-mode-auto)
(package! wakatime-mode)
(package! ob-mermaid)
(package! org-roam-server)
(package! yasnippet-snippets)
(package! org-ref)
(package! citeproc-org)
(package! helm
  :disable t)
(package! code-stats)
