# Taps
tap "515hikaru/tap"
tap "caskroom/versions"
tap "d12frosted/emacs-plus"
tap "getantibody/tap"
tap "git-chglog/git-chglog"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# brew install
brew "ack"
brew "libyaml"
brew "openssl@1.1"
brew "readline", link: true
brew "ansible"
brew "antibody"
brew "asciinema"
brew "aspell"
brew "astyle"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "awscli"
brew "bash"
brew "bfg"
brew "binutils"
brew "libffi"
brew "capstone"
brew "ccache"
brew "cmake"
brew "libmpc"
brew "gcc"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "cookiecutter"
brew "coreutils"
brew "llvm"
brew "cquery"
brew "gawk"
brew "gnu-sed"
brew "libtool"
brew "make", link: false
brew "ncurses"
brew "crosstool-ng"
brew "csvkit"
brew "ctags"
brew "curl"
brew "curl-openssl"
brew "diff-so-fancy"
brew "dtc"
brew "editorconfig"
brew "node", link: false
brew "exa"
brew "expat"
brew "fasd"
brew "fd"
brew "pkg-config"
brew "fish"
brew "fzf"
brew "nss"
brew "gdal"
brew "git"
brew "libusb"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "grv"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "ispell"
brew "isync"
brew "javacc"
brew "jq"
brew "libftdi"
brew "loc"
brew "lsusb"
brew "mas"
brew "md5sha1sum", link: false
brew "minicom"
brew "mkcert"
brew "mosh"
brew "multimarkdown"
brew "n"
brew "nasm"
brew "neovim"
brew "zlib"
brew "pandoc"
brew "pgcli"
brew "pidof"
brew "pinentry-mac"
brew "pre-commit"
brew "pypy3"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tig"
brew "tmux"
brew "tor", restart_service: true
brew "tree"
brew "unrar"
brew "vim", args: ["HEAD"]
brew "wakatime-cli"
brew "watch"
brew "wget"
brew "wordnet"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "515hikaru/tap/mdtable2csv"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-jansson"]
brew "git-chglog/git-chglog/git-chglog"
brew "golangci/tap/golangci-lint"
brew "heroku/brew/heroku"
brew "kyoh86/tap/richgo"
brew "riscv/riscv/riscv-gnu-toolchain", link: false
brew "riscv/riscv/riscv-tools"
cask "1password-cli"
cask "alacritty"
cask "basictex"
cask "ckb-next"
cask "discord"
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata-dz"
cask "font-inconsolata-dz-for-powerline"
cask "font-input"
cask "font-monoid"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "insomnia"
cask "keybase"
cask "kindle"
cask "maccy"
cask "ngrok"
cask "podman"
cask "postgres"
cask "skype"
cask "sloth"
cask "spotify"
cask "telegram"
cask "transmission"
cask "vagrant"
